eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/src/mdr32f8_eth.c
/**
  ******************************************************************************
  * @file	 MDR32F9Qx_eth.c
  * @author	 sidorov.a
  * @version V1.4.0
  * @date    26.04.2013
  * @brief   This file contains all the ethernet firmware functions.
  ******************************************************************************
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2013 Milandr </center></h2>
  ******************************************************************************
  * FILE MDR32F9Qx_eth.c
  */

/* Includes ------------------------------------------------------------------*/
#include "mdr32f8_eth.h"
#include "mdr32f8_dma.h"
#include "mdr32f8_clkctrl.h"
#include "MDR1986VE8T.h"

#include <math.h>
#include <stdio.h>

#define ASSERT_INFO_FILE_ID FILEID__MDR32F9X_ETH_C

/** @addtogroup __MDR32F9Qx_StdPeriph_Driver MDR32F9Qx Standard Peripherial Driver
  * @{
  */

/** @defgroup ETHERNET ETHERNET
 *  @warning This module can be used only for microcontrollers MDR1986VE1T and MDR1986VE3.
  * @{
  */



/** @defgroup ETH_Exported_Variables ETH Exported Variables
 *  @{
 */
extern DMA_CtrlDataTypeDef DMA_ControlTable[DMA_Channels_Number * (1 + DMA_AlternateData)];
/** @} */ /* End of group ETH_Exported_Variables */

/** @defgroup ETH_Private_Defines ETH Private Defines
  * @{
  */

#if defined (USE_MDR1986VE3)
	#define IS_ETH_ALL_PERIPH(PERIPH)				((PERIPH == MDR_ETHERNET1) ||\
													 (PERIPH == MDR_ETHERNET1))
#elif defined (USE_MDR1986VE1T)
	#define IS_ETH_ALL_PERIPH(PERIPH)				(PERIPH == MDR_ETHERNET1)
#endif
#define IS_ETH_PHY_ADDRESS(ADDRESS)				(((ADDRESS << ETH_PHY_CONTROL_PHYADD_Pos) & (~ETH_PHY_CONTROL_PHYADD_Msk)) == 0)
#define IS_ETH_COL_WND(WND)						(WND <= 0xFF)
#define IS_ETH_RETRY_COUNTER(COUNTER)			(COUNTER <= 0x0F)
#define IS_ETH_DELIMITER(DELIMITER)				((DELIMITER >= 0x5EA) && (DELIMITER <= 0x1A16))

#define ETH_BUFFER_SIZE							((uint32_t)0x2000)

/** @} */ /* End of group ETH_Private_Defines */

/** @defgroup ETH_Private_Macros ETH Private Macros
  * @{
  */
/** @} */ /* End of group ETH_Private_Macros */

/** @defgroup ETH_Private_Variables ETH Private Variables
  * @{
  */

/** @} */ /* End of group ETH_Private_Variables */

/** @defgroup ETH_Private_FunctionPrototypes ETH Private FunctionPrototypes
  * @{
  */
/** @} */ /* End of group ETH_Private_FunctionPrototypes */

/** @defgroup ETH_Private_Functions ETH Private Functions
  * @{
  */

/**
  * @brief	Reset the ETHERNET clock registers to their default reset values.
  * @param	None
  * @retval	None
  */
void ETH_ClockDeInit(void)
{
	uint32_t tmpreg_EMAC_CLOCK;
	uint32_t tmpreg_EPHY_CLOCK;

	/* Read old value */
	tmpreg_EMAC_CLOCK = CLK_CNTR->EMAC0_CLK;
	tmpreg_EPHY_CLOCK = CLK_CNTR->EPHY0_CLK;

	/* Reset all settings for Ethernet and PHY */
	tmpreg_EPHY_CLOCK &= ~(RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Msk |
						  RST_CLK_ETH_CLOCK_PHY_CLK_EN |
						  RST_CLK_ETH_CLOCK_PHY_BRG_Msk);
	
	tmpreg_EMAC_CLOCK &= ~(RST_CLK_ETH_CLOCK_ETH_CLK_EN |
						  RST_CLK_ETH_CLOCK_ETH_BRG_Msk);
	
	/* Save new value */
  CLK_CNTR->EMAC0_CLK = tmpreg_EMAC_CLOCK;
	CLK_CNTR->EPHY0_CLK = tmpreg_EPHY_CLOCK;
}

/**
  * @brief	Config the PHY clock register.
  * @param	clock_source: defines the frequency source for the PHY.
  * 		This parameter can be one of the following values:
  * 			@arg ETH_PHY_CLOCK_SOURCE_HSI
  * 			@arg ETH_PHY_CLOCK_SOURCE_HSE
  * 			@arg ETH_PHY_CLOCK_SOURCE_PLLCPU_0
  * 			@arg ETH_PHY_CLOCK_SOURCE_HSE2
  * @param	PHY_HCLKdiv: specifies the HCLK division factor.
  * 		This parameter can be one of the following values:
  * 			@arg ETH_PHY_HCLKdiv1
  * 			@arg ETH_PHY_HCLKdiv2
  * 			@arg ETH_PHY_HCLKdiv4
  * 			@arg ETH_PHY_HCLKdiv8
  * 			@arg ETH_PHY_HCLKdiv16
  * 			@arg ETH_PHY_HCLKdiv32
  * 			@arg ETH_PHY_HCLKdiv64
  * 			@arg ETH_PHY_HCLKdiv128
  * @retval	None
  */
void ETH_PHY_ClockConfig(uint32_t clock_source, uint32_t PHY_HCLKdiv)
{
	//uint32_t tmpreg_EMAC_CLOCK;
	uint32_t tmpreg_EPHY_CLOCK;
	/* Check the parameters */
	assert_param(IS_ETH_CLOCK_SOURCE(clock_source));
	assert_param(IS_ETH_PHY_HCLKdiv(PHY_HCLKdiv));

	tmpreg_EPHY_CLOCK = CLK_CNTR->EPHY0_CLK;
	tmpreg_EPHY_CLOCK &= ~ (RST_CLK_ETH_CLOCK_PHY_BRG_Msk | RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Msk);

	/* Select clock source for PHY module and set PHY DIV */
	tmpreg_EPHY_CLOCK |= clock_source | PHY_HCLKdiv;
	/* Enable PHY CLK */
	tmpreg_EPHY_CLOCK |= RST_CLK_ETH_CLOCK_PHY_CLK_EN;

	CLK_CNTR->EPHY0_CLK = tmpreg_EPHY_CLOCK;
}

/**
  * @brief	Initializes the ETHERNET peripheral Clock according to the
  *         specified parameters.
  * @param	ETH_HCLKdiv: specifies the HCLK division factor.
  * 		This parameter can be one of the following values:
  * 			@arg ETH_HCLKdiv1
  * 			@arg ETH_HCLKdiv2
  * 			@arg ETH_HCLKdiv4
  * 			@arg ETH_HCLKdiv8
  * 			@arg ETH_HCLKdiv16
  * 			@arg ETH_HCLKdiv32
  * 			@arg ETH_HCLKdiv64
  * 			@arg ETH_HCLKdiv128
  * @retval	None
  */
void ETH_BRGInit(uint32_t ETH_HCLKdiv)
{
	uint32_t tmpreg_EMAC_CLOCK;

	/* Check the parameters */
	assert_param(IS_ETH_CLOCK_BRG(ETH_HCLKdiv));

	tmpreg_EMAC_CLOCK = CLK_CNTR->EMAC0_CLK;
	tmpreg_EMAC_CLOCK &= ~(RST_CLK_ETH_CLOCK_ETH_BRG_Msk);
	tmpreg_EMAC_CLOCK |= ETH_HCLKdiv;

	CLK_CNTR->EMAC0_CLK = tmpreg_EMAC_CLOCK;
}

/**
  * @brief	Enables or disables the specified ETHERNET clock.
  * @param	ETHx: Slect the number of ETHERNET interface.
  * 		This parameter can be one of the following values:
  * 			@arg ETH_CLK1
  * 			@arg ETH_CLK2
  * @param	NewState: new state of the ETHERNET interface clock.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_ClockCMD(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_ETH_CLK(ETHx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

