eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/src/mdr32f8_eth.c
	if(NewState == ENABLE){
		CLK_CNTR->EMAC0_CLK |= (1<<16);
	}
	else{
		CLK_CNTR->EMAC0_CLK &= ~(1<<16);
	}
}

/**
  * @brief	Reset the ETHERNETx peripheral registers to their default reset values.
  * @param	ETHERNETx: Slect the ETHERNET peripheral.
  *         This parameter can be one of the following values:
  *         MDR_ETHERNET1, MDR_ETHERNET2.
  * @retval	None
  */
void ETH_PHY_Reset(MDR_ETH_TypeDef * ETHERNETx)
{
	/* Check the parameters */
	assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
	/* Reset PHY */
	ETHERNETx->PHY_CONTROL &= ~ETH_PHY_CONTROL_RST;

	/* Wait until the PHY unit did not come out in the state after a hard reset. */
	//while(ETH_GetPHYStatus(ETHERNETx, ETH_PHY_FLAG_READY) != SET);
}

/**
  * @brief	Enables or disables the PHY.
  * @param	ETHERNETx: Slect the ETHERNET peripheral.
  *         This parameter can be one of the following values:
  *         MDR_ETHERNET1, MDR_ETHERNET2 for MDR1986VE3 and
  *         MDR_ETHERNET1 for MDR1986VE1T.
  * @param	NewState: new state of the PHY.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval	None
  */
void ETH_PHYCmd(MDR_ETH_TypeDef * ETHERNETx, FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if(NewState == ENABLE){
		ETHERNETx->PHY_CNTR_A |= ETH_PHY_CONTROL_A_EN_PHY;
	}
	else{
		ETHERNETx->PHY_CNTR_A &= ~ETH_PHY_CONTROL_A_EN_PHY;
	}

}

/**
  * @brief	Deinitializes the ETHERNET peripheral registers to their default reset values.
  * @param	ETHERNETx: Slect the ETHERNET peripheral.
  *         This parameter can be one of the following values:
  *         MDR_ETHERNET1, MDR_ETHERNET2 for MDR1986VE3 and
  *         MDR_ETHERNET1 for MDR1986VE1T.
  * @retval	None
  */
void ETH_DeInit(MDR_ETH_TypeDef * ETHERNETx )
{
	/* Check the parameters */
	assert_param(IS_ETH_ALL_PERIPH(ETHERNETx));

	/* PHY reset */
	ETH_PHY_Reset(ETHERNETx);

	ETHERNETx->DILIMETR = 0x1000;
	ETHERNETx->MAC_T 		= 0x78AB;
	ETHERNETx->MAC_M 		= 0x3456;
	ETHERNETx->MAC_H 		= 0x0012;
	ETHERNETx->HASH0 		= 0x0000;
	ETHERNETx->HASH1 		= 0x0000;
	ETHERNETx->HASH2 		= 0x0000;
	ETHERNETx->HASH3 		= 0x8000;
	ETHERNETx->IPG 			= 0x0060;
	ETHERNETx->PSC 			= 0x0031;
	ETHERNETx->BAG 			= 0x0064;
	ETHERNETx->JITTERWND 	= 0x0004;
	ETHERNETx->R_CFG 		= 0x0507;
	ETHERNETx->X_CFG 		= 0x01FA;
	ETHERNETx->G_CFGl 	= 0x4080;
	ETHERNETx->G_CFGh		= 0x3000;
	ETHERNETx->IMR 			= 0x0000;
	ETHERNETx->IFR 			= 0x0000;
	ETHERNETx->R_HEAD 	= 0x0000;
	ETHERNETx->X_TAIL 	= 0x1000;
	ETHERNETx->STAT			= 0x0000;
}

/**
  * @brief	Fills each ETH_InitStruct member with its default value.
  * @param	ETH_InitStruct: pointer to a ETH_InitTypeDef structure which will be initialized.
  * @retval	None
  */
void ETH_StructInit(ETH_InitTypeDef * ETH_InitStruct)
{

//	/* Set PHY address */
//	ETH_InitStruct->ETH_PHY_Address = 0x1C;
//	/* PHY Auto-negotiation enabled */
//	ETH_InitStruct->ETH_PHY_Mode = ETH_PHY_MODE_AutoNegotiation;
//	/* Set the working interface */
//	ETH_InitStruct->ETH_PHY_Interface = ETH_PHY_INTERFACE_ETHERNET_802_3;

	ETH_InitStruct->ETH_PHY_LB = DISABLE;
	
	ETH_InitStruct->ETH_PHY_DLB = DISABLE;
	
	ETH_InitStruct->ETH_PHY_HALFD = DISABLE;

	ETH_InitStruct->ETH_PHY_EARLY_DV = DISABLE;	
	
	ETH_InitStruct->ETH_PHY_DIR = 0;	
	
	ETH_InitStruct->ETH_PHY_BASE_2 = 0;		
	
	ETH_InitStruct->ETH_PHY_LINK_PERIOD = 0;	
	
	ETH_InitStruct->ETH_PHY_EXT_EN = 0;		
	
	
	/* General config*/
	ETH_InitStruct->ETH_Dilimiter = 0x0800;
	/* Set the DBG Mode */
	ETH_InitStruct->ETH_DBG_Mode = ETH_DBG_MODE_FREE_RUN;
	/* Enable automatically change the transmitter FIFO pointers in DBG Mode. */
	ETH_InitStruct->ETH_DBG_XF = ENABLE;
	/* Enable automatically change the receiver FIFO pointers in DBG Mode. */
	ETH_InitStruct->ETH_DBG_RF = ENABLE;
	/* Loopback disabled. */
	ETH_InitStruct->ETH_Loopback_Mode = DISABLE;
	/* Disable the receiver. */
	ETH_InitStruct->ETH_Receiver_RST = RESET;
	/* Disable the transmitter. */
	ETH_InitStruct->ETH_Transmitter_RST = RESET;
	/* Enables reset STATUS register when read in. */
	ETH_InitStruct->ETH_Register_CLR = ENABLE;
	/* Set the Buffer FIFO mode */
	ETH_InitStruct->ETH_Buffer_Mode = ETH_BUFFER_MODE_LINEAR;
	/* Disable mode additions to the size of short packets slotTime field "Extension". */
	ETH_InitStruct->ETH_Extension_Mode = DISABLE;
	/* Disable the half duplex mode/ */
	ETH_InitStruct->ETH_HalfDuplex_Mode = DISABLE;
	/* Disable the deterministic mode delivery time. */
	ETH_InitStruct->ETH_DTRM = DISABLE;
	/* Disable the automatic packet processing PAUSE. */
	ETH_InitStruct->ETH_Pause = DISABLE;
	/* Set the size of window collisions */
	ETH_InitStruct->ETH_ColWnd = 0x80;

	/* Transmitter config */
	/* Disable the transmitter. */
	ETH_InitStruct->ETH_Transmitter_State = DISABLE;
	/* Set the sequence of bytes in the word transmitter. */
	ETH_InitStruct->ETH_Transmitter_BE = ETH_TRANSMITTER_BE_LITTLE_ENDIAN;
	/* Set the order of the bits in the transmission of data bytes. */
	ETH_InitStruct->ETH_Transmitter_Bits_Order = ETH_TRANSMITTER_BITS_ORDER_LSB;
	/* Setting the operating mode output EVNT [1]. */
	ETH_InitStruct->ETH_Transmitter_Event_Mode = ETH_TRANSMITTER_EVENT_MODE_XFIFO_ALMOST_EMPTY;
	/* Enable addition to the minimum packet length PAD-s. */
	ETH_InitStruct->ETH_Automatic_Pad_Strip = ENABLE;
	/* Enable supplement packet preamble. */
	ETH_InitStruct->ETH_Automatic_Preamble = ENABLE;
	/* Enable supplement package will automatically calculate the CRC. */
	ETH_InitStruct->ETH_Automatic_CRC_Strip = ENABLE;
	/* Enable exposure mode pauses between sending packets. */
	ETH_InitStruct->ETH_Automatic_IPG = ENABLE;
	/* Set the maximum number of attempts to send a packet. */
	ETH_InitStruct->ETH_Retry_Counter = 0x0A;

	/* Receiver config  */
	/* Disable the receiver. */
	ETH_InitStruct->ETH_Receiver_State = DISABLE;
	/* Set the sequence of bytes in a word. */
	ETH_InitStruct->ETH_Receiver_BE = ETH_RECEIVER_BE_LITTLE_ENDIAN;
	/* Set the sequence of bits at the reception of data bytes. */
	ETH_InitStruct->ETH_Receiver_Bits_Order = ETH_RECEIVER_BITS_ORDER_LSB;
	/* Setting the operating mode output EVNT [0]. */
	ETH_InitStruct->ETH_Receiver_Event_Mode = ETH_RECEIVER_EVENT_MODE_PACET_RECEIVED;
	/* Disable receive all packets. */
	ETH_InitStruct->ETH_Receive_All_Packets = DISABLE;
	/* Disable receiving packets of length less than the minimum. */
	ETH_InitStruct->ETH_Short_Frames_Reception = DISABLE;
	/* Disable receiving packets of length greater than the maximum. */
	ETH_InitStruct->ETH_Long_Frames_Reception = DISABLE;
	/* Enable receiving packets with broadcast MAC-address. */
	ETH_InitStruct->ETH_Broadcast_Frames_Reception = ENABLE;
	/* Disable receiving packets with errors. */
	ETH_InitStruct->ETH_Error_CRC_Frames_Reception = DISABLE;
	/* Disable receive control packets. */
	ETH_InitStruct->ETH_Control_Frames_Reception = DISABLE;
	/* Enable receiving packets with MAC-address specified in the register MAC_Address. */
	ETH_InitStruct->ETH_Unicast_Frames_Reception = ENABLE;
	/* Enable receiving packets with a multicast MAC-address-filtered HAS-table. */
	ETH_InitStruct->ETH_Source_Addr_HASH_Filter = ENABLE;

