eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/src/mdr32f8_eth.c
	/* Read the buffer mode */
	BufferMode = (ETHERNETx->G_CFGl & ETH_G_CFGl_BUFF_MODE_Msk);
	/* Send packet */
	Xtail = ETHERNETx->X_TAIL;

	switch (BufferMode){
		case ETH_BUFFER_MODE_LINEAR:
			/* Set pointer to output buffer */
			ptr_OutputFrame = (uint32_t *)((((uint32_t)ETHERNETx) + 0x00008000) + Xtail);
			/* Send frame */
			EthReceiverFreeBufferSize = (ETH_BUFFER_SIZE - Xtail) / 4;
			if(((BufLen +3)/4 + 1) < EthReceiverFreeBufferSize){
				for( i = 0; i < (BufLen + 3)/4 + 1; i++ ){
					*ptr_OutputFrame++ = ptr_OutputBuffer[i];
				}
			}
			else{
				for( i = 0; i < EthReceiverFreeBufferSize; i++ ){
					*ptr_OutputFrame++ = ptr_OutputBuffer[i];
				}
				tmp = i;
				ptr_OutputFrame = (uint32_t *)((((uint32_t)ETHERNETx) + 0x00008000) + ETHERNETx->DILIMETR);
				for(i = 0; i < (((BufLen + 3)/4 + 1) - EthReceiverFreeBufferSize); i++){
					*ptr_OutputFrame++ = ptr_OutputBuffer[i+tmp];
				}
			}
			ptr_OutputFrame++;
			Xtail = (uint32_t)ptr_OutputFrame&0x3FFC;
			if(Xtail >= ETH_BUFFER_SIZE)
				Xtail = ETHERNETx->DILIMETR;
			/* Write the new value of the ETH_X_Tail register */
			ETHERNETx->X_TAIL = Xtail;
			break;
		case ETH_BUFFER_MODE_AUTOMATIC_CHANGE_POINTERS:
			/* Set pointer to output buffer */
			ptr_OutputFrame = (uint32_t *)((((uint32_t)ETHERNETx) + 0x00008000) + Xtail);
			/* Send frame */
			EthReceiverFreeBufferSize = (ETH_BUFFER_SIZE - Xtail) / 4;
			if(((BufLen +3)/4 + 2) < EthReceiverFreeBufferSize){
				for( i = 0; i < (BufLen + 3)/4 + 2; i++ ){
					*ptr_OutputFrame++ = ptr_OutputBuffer[i];
				}
			}
			else{
				for( i = 0; i < EthReceiverFreeBufferSize; i++ ){
					*ptr_OutputFrame++ = ptr_OutputBuffer[i];
				}
				tmp = i;
				ptr_OutputFrame = (uint32_t *)((((uint32_t)ETHERNETx) + 0x00008000) + ETHERNETx->DILIMETR);
				for(i = 0; i < (((BufLen + 3)/4 + 2) - EthReceiverFreeBufferSize); i++){
					*ptr_OutputFrame++ = ptr_OutputBuffer[i+tmp];
				}
			}
			break;
		case ETH_BUFFER_MODE_FIFO:
			/* Set the pointer to input frame */
			ptr_OutputFrame = (uint32_t *) ((uint32_t)ETHERNETx + 0x00008004);
			/* Send frame */
			ETH_DMAFrameTx(ptr_OutputFrame, ((BufLen+3)/4 + 2), ptr_OutputBuffer);
			break;
	}
}

/**
  * @brief	Init the DMA channel.
  * @param	None
  * @retval	None.
  */
void ETH_DMAPrepare(void)
{
	DMA_CtrlDataInitTypeDef DMA_PriCtrlStr;
	DMA_ChannelInitTypeDef DMA_InitStr;
	
  CLKCTRL_PER0_CLKcmd(CLKCTRL_PER0_CLK_MDR_DMA0_EN, ENABLE);
	DMA_DeInit();
	
	DMA_StructInit(&DMA_InitStr);

	/* Set Channel Structure */
	DMA_InitStr.DMA_PriCtrlData = &DMA_PriCtrlStr;
	DMA_InitStr.DMA_Priority = DMA_Priority_High;
	DMA_InitStr.DMA_UseBurst = DMA_BurstClear;
	DMA_InitStr.DMA_SelectDataStructure = DMA_CTRL_DATA_PRIMARY;
	/* Init DMA channel */
	DMA_Init(DMA_Channel_SW1, &DMA_InitStr);
  DMA_Init(DMA_Channel_SW2, &DMA_InitStr);
}

/**
  * @brief	Receives a frame on the ethernet DMA channel in FIFO mode.
  * @param	DstBuf: pouinter to destination array.
  * @param	BufferSize: size of the transmission.
  * @param	SrcBuf: pointer to source array.
  * @retval None
  */
void ETH_DMAFrameRx(uint32_t * DstBuf, uint32_t BufferSize, uint32_t *  SrcBuf)
{

	__IO uint32_t * ptrControltable;
	uint32_t tmpval;

	MDR_DMA->CHNL_PRIORITY_SET |= 1 << DMA_Channel_SW1;
	DMA_ControlTable[DMA_Channel_SW1].DMA_SourceEndAddr = (uint32_t)SrcBuf;
	DMA_ControlTable[DMA_Channel_SW1].DMA_DestEndAddr = ((uint32_t)DstBuf) + 4*(BufferSize-1);
	DMA_ControlTable[DMA_Channel_SW1].DMA_Control = DMA_DestIncWord
												  | DMA_SourceIncNo
												  | DMA_MemoryDataSize_Word
												  | DMA_Mode_AutoRequest
												  | DMA_Transfers_1024
												  | ((BufferSize - 1) << 4);

	/* Run channel */
	DMA_Cmd(DMA_Channel_SW1, ENABLE);
	DMA_Request(DMA_Channel_SW1);
	/* Get pointer to DMA control struct */
	ptrControltable = (uint32_t *)&DMA_ControlTable[DMA_Channel_SW1].DMA_Control;
	/* Wait while DMA running */
	while( 1 ){
		tmpval = (*ptrControltable)&0x7;
		if(tmpval == 0)
			break;
	}
	/* Disable DMA channel */
	DMA_Cmd(DMA_Channel_SW1, DISABLE);

}

/**
  * @brief	Send a frame on the ethernet DMA channel in FIFO mode.
  * @param	DstBuf: pouinter to destination array.
  * @param	BufferSize: size of the transmission.
  * @param	SrcBuf: pointer to source array.
  * @retval	None
  */
void ETH_DMAFrameTx(uint32_t * DstBuf, uint32_t BufferSize, uint32_t * SrcBuf)
{
	__IO uint32_t * ptrControltable;
	uint32_t tmpval;

	MDR_DMA->CHNL_PRIORITY_SET |= 1 << DMA_Channel_SW2;
	DMA_ControlTable[DMA_Channel_SW2].DMA_SourceEndAddr = (uint32_t)SrcBuf + 4*(BufferSize-1);
	DMA_ControlTable[DMA_Channel_SW2].DMA_DestEndAddr = (uint32_t)DstBuf;
	DMA_ControlTable[DMA_Channel_SW2].DMA_Control = DMA_DestIncNo
												  | DMA_SourceIncWord
												  | DMA_MemoryDataSize_Word
												  | DMA_Mode_AutoRequest

												  | DMA_Transfers_1024
												  | ((BufferSize - 1) << 4);
	/* Run channel */
	DMA_Cmd(DMA_Channel_SW2, ENABLE);
	DMA_Request(DMA_Channel_SW2);
	/* Get pointer to DMA control struct */
	ptrControltable = (uint32_t *)&DMA_ControlTable[DMA_Channel_SW2].DMA_Control;
	/* Wait while DMA running */
	while( 1 ){
		tmpval = (*ptrControltable)&0x7;
		if(tmpval == 0)
			break;
	}
	/* Disable DMA channel */
	DMA_Cmd(DMA_Channel_SW2, DISABLE);
}

/** @} */ /* End of group ETH_Private_Functions */



/** @} */ /* End of group ETHERNET ETHERNET  */

/** @} */ /* End of group __MDR32F9Qx_StdPeriph_Driver */

/******************* (C) COPYRIGHT 2013 Milandr ********************************
*
* END OF FILE MDR32F9Qx_eth.c */
